dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_centroid.c
/***************************************************************************//**
* \file cy_capsense_centroid.c
* \version 1.0
*
* \brief
* This file provides the source code for the centroid calculation methods
* of the CapSense middleware.
*
********************************************************************************
* \copyright
* Copyright 2018, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include <string.h>
#include <stddef.h>
#include <stdint.h>
#include "cy_syslib.h"
#include "cy_capsense_centroid.h"
#include "cy_capsense_common.h"
#include "cy_capsense_lib.h"
#include "cy_capsense_structure.h"
#include "cy_capsense_filter.h"


/*******************************************************************************
* Local definition
*******************************************************************************/
#define CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_LENGTH        (3u)
#define CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_PREVIOUS      (0u)
#define CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_CENTER        (1u)
#define CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_NEXT          (2u)
/* Minimum valid age */
#define CY_CAPSENSE_CSX_TOUCHPAD_AGE_START              (0x0100u)
#define CY_CAPSENSE_CSX_TOUCHPAD_Z_SHIFT                (0x04u)
#define CY_CAPSENSE_CSX_TOUCHPAD_BYTE_SHIFT             (8u)
#define CY_CAPSENSE_CENTROID_ROUND_VALUE                (0x7Fu)
#define CY_CAPSENSE_NO_LOCAL_MAX                        (0xFFFFu)

/*******************************************************************************
* Function Prototypes
*******************************************************************************/
static void Cy_CapSense_TransferTouch(
                uint32_t newIndex, 
                uint32_t oldIndex, 
                const cy_stc_capsense_widget_config_t * ptrWdConfig);
static void Cy_CapSense_NewTouch(
                uint32_t newIndex, 
                const cy_stc_capsense_widget_config_t * ptrWdConfig);
static uint32_t Cy_CapSense_CalcDistance(
                uint32_t newIndex, 
                uint32_t oldIndex,
                const cy_stc_capsense_widget_config_t * ptrWdConfig);
static void Cy_CapSense_Hungarian(
                const cy_stc_capsense_widget_config_t * ptrWdConfig);
static void Cy_CapSense_CopyTouchRecord(
                cy_stc_capsense_position_t * destination,
                const cy_stc_capsense_position_t * source);
__STATIC_INLINE void Cy_CapSense_TouchDownDebounce(
                const cy_stc_capsense_widget_config_t * ptrWdConfig);
__STATIC_INLINE void Cy_CapSense_SortByAge(
                const cy_stc_capsense_widget_config_t * ptrWdConfig);
__STATIC_INLINE uint8_t Cy_CapSense_GetLowestId(uint8_t idMask);


/*******************************************************************************
* Function Name: Cy_CapSense_DpCentroidDiplex
****************************************************************************//**
*
* Finds touch position of a Linear slider widget with enabled diplexing.
*
* In scope of position searching this function finds local maximum with the
* highest raw count. If such maximums are more than one then the maximum with 
* bigger sum of neighbor sensors is taken for further processing. Then position
* is calculated using centroid algorithm with 3 sensors.
*
* At least two neighbor sensor should cross finger threshold, then the algorithm 
* is able to distinguish where real touch is located (direct part of slider or
* diplex part of slider) and corresponding position is reported. Otherwise no 
* touch is reported.
*
* This function does not detect two or more touches.
* 
* \param newTouch
* The pointer to the touch structure where found position is stored.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
*******************************************************************************/
void Cy_CapSense_DpCentroidDiplex(
                cy_stc_capsense_touch_t * newTouch,
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t sum;
    uint32_t diffM;
    uint32_t diffP;
    uint32_t snsIndex;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt;
    const uint8_t * ptrDpxTable;
    uint32_t snsCount = ptrWdConfig->numSns;
    
    uint32_t maxSum = 0u;
    uint32_t maxDiff = 0u;
    uint32_t maxIndex = CY_CAPSENSE_NO_LOCAL_MAX;
    uint32_t threshold = ptrWdConfig->ptrWdContext->fingerTh;
    int32_t numerator = 0;
    int32_t denominator = 0;
    uint32_t multiplier;
    uint32_t offset;
    
    threshold -= ptrWdConfig->ptrWdContext->hysteresis;
    ptrDpxTable = ptrWdConfig->ptrDiplexTable;
    
    /* Find maximum signal */
    ptrSnsCxt = ptrWdConfig->ptrSnsContext;
    for (snsIndex = 0u; snsIndex < snsCount; snsIndex++)
    {
        if (maxDiff < ptrSnsCxt->diff)
        {
            maxDiff = ptrSnsCxt->diff;
        }
        ptrSnsCxt++;
    }

    /* Find sensor index with maximum sum ([i-1],[i],[i+1]) including diplex part */
    ptrSnsCxt = ptrWdConfig->ptrSnsContext;
    for (snsIndex = 0u; snsIndex < (snsCount << 1u); snsIndex++)
    {
        /* Potential maximum */
        if (maxDiff == ptrSnsCxt[ptrDpxTable[snsIndex]].diff)
        {
            /* Get sum of differences around maximum */
            diffM = (snsIndex > 0u) ? ptrSnsCxt[ptrDpxTable[snsIndex - 1u]].diff : 0u;
            diffP = (snsIndex < ((snsCount << 1u) - 1u)) ? ptrSnsCxt[ptrDpxTable[snsIndex + 1u]].diff : 0u;
            sum = ptrSnsCxt[ptrDpxTable[snsIndex]].diff + diffM + diffP;
            if ((diffM < threshold) && (diffP < threshold))
            {
                sum = 0u;
            }
            if (maxSum < sum)
            {
                /* New maximum */
                maxIndex = snsIndex;
                maxSum = sum;
                numerator = (int32_t)diffP - (int32_t)diffM;
            }
        }
    }
    
    if (maxIndex != CY_CAPSENSE_NO_LOCAL_MAX)
    {
        multiplier = (uint32_t)ptrWdConfig->xResolution << 8u;
        /* Calculate position */
        if (0u == (ptrWdConfig->centroidConfig & CY_CAPSENSE_CALC_METHOD_MASK))
        {
            multiplier /= ((snsCount << 1u) - 1u);
            offset = 0u;
        }
        else
        {
            multiplier /= (snsCount << 1u);
            offset = multiplier >> 1u;
        }
        
        denominator = (int32_t)maxSum;
        denominator = ((numerator * (int32_t)multiplier) / denominator) + (((int32_t)maxIndex * (int32_t)multiplier) + (int32_t)offset);
                    
        /* Round result and shift 8 bits left */
        newTouch->numPosition = CY_CAPSENSE_POSITION_ONE;
        newTouch->ptrPosition[0u].x = CY_LO16(((uint32_t)denominator + CY_CAPSENSE_CENTROID_ROUND_VALUE) >> 8u);
    }
    else
    {
        newTouch->numPosition = CY_CAPSENSE_POSITION_NONE;
    }
}


