dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_centroid.c
/*******************************************************************************
* Function Name: Cy_CapSense_DpCentroidLinear
****************************************************************************//**
*
* Finds touch position of a Linear slider widget.
*
* In scope of position searching this function finds local maximum with the
* highest raw count. If such maximums are more than one then the maximum with 
* bigger sum of neighbor sensors is taken for further processing. Then position
* is calculated using centroid algorithm with 3 sensors.
*
* This function does not detect two or more touches.
* 
* \param newTouch
* The pointer to the touch structure where the found position is stored.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
*******************************************************************************/
void Cy_CapSense_DpCentroidLinear(
                cy_stc_capsense_touch_t * newTouch,
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t snsIndex = 0u;
    uint32_t snsCount = ptrWdConfig->numSns;
    
    uint32_t diffM;
    uint32_t diffP;
    uint32_t sum = 0u;
    uint32_t maxSum = 0u;
    uint32_t maxDiff = 0u;
    uint32_t maxIndex = 0u;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt;
    int32_t numerator = 0;
    int32_t denominator = 0;
    uint32_t multiplier;
    uint32_t offset;
    
    if (1u == (ptrWdConfig->centroidConfig & CY_CAPSENSE_CENTROID_NUMBER_MASK))
    {
        /* Find maximum signal */
        ptrSnsCxt = ptrWdConfig->ptrSnsContext;
        for (snsIndex = 0u; snsIndex < snsCount; snsIndex++)
        {
            if (ptrSnsCxt->diff > maxDiff)
            {
                maxDiff = ptrSnsCxt->diff;
            }
            ptrSnsCxt++;
        }
        
        /* Find index of sensor with maximum signal */
        ptrSnsCxt = ptrWdConfig->ptrSnsContext;
        for (snsIndex = 0u; snsIndex < snsCount; snsIndex++)
        {
            /* Potential maximum */
            if (maxDiff == ptrSnsCxt->diff)
            {
                /* Get sum of differences around maximum */
                diffM = (snsIndex > 0u) ? (ptrSnsCxt - 1u)->diff : 0u;
                diffP = (snsIndex < (snsCount - 1u)) ? (ptrSnsCxt + 1u)->diff : 0u;
                sum = ptrSnsCxt->diff + diffM + diffP;
                if (maxSum < sum)
                {
                    /* New maximum */
                    maxIndex = snsIndex;
                    maxSum = sum;
                    numerator = (int32_t)diffP - (int32_t)diffM;
                }
            }
            ptrSnsCxt++;
        }
        
        /* Calculate position */
        multiplier = (uint32_t)ptrWdConfig->xResolution << 8u;
        if (0u == (ptrWdConfig->centroidConfig & CY_CAPSENSE_CALC_METHOD_MASK))
        {
            multiplier /= (snsCount - 1u);
            offset = 0u;
        }
        else
        {
            multiplier /= snsCount;
            offset = multiplier >> 1u;
        }
        
        denominator = (int32_t)maxSum;
        denominator = ((numerator * (int32_t)multiplier) / denominator) + (((int32_t)maxIndex * (int32_t)multiplier) + (int32_t)offset);
                    
        /* Round result and shift 8 bits left */
        newTouch->numPosition = 1u;
        newTouch->ptrPosition[0u].x = CY_LO16(((uint32_t)denominator + CY_CAPSENSE_CENTROID_ROUND_VALUE) >> 8u);
    }
    else
    {
        /* This is a place holder for local maximum searching when number of centroids could be more than one */
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_DpCentroidRadial
****************************************************************************//**
*
* Finds touch position of a Radial slider widget.
*
* In scope of position searching this function finds local maximum with the
* highest raw count. If such maximums are more than one, then the maximum with 
* bigger sum of neighbor sensors is taken for further processing. Then position
* is calculated using centroid algorithm with 3 sensors.
*
* This function does not detect two or more touches.
* 
* \param newTouch
* The pointer to the touch structure where found position is stored.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
*******************************************************************************/
void Cy_CapSense_DpCentroidRadial(
                cy_stc_capsense_touch_t * newTouch,
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t snsIndex = 0u;
    uint32_t snsCount = ptrWdConfig->numSns;
    
    uint32_t diffM;
    uint32_t diffP;
    uint32_t sum = 0u;
    uint32_t maxSum = 0u;
    uint32_t maxDiff = 0u;
    uint32_t maxIndex = 0u;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt;
    int32_t numerator = 0;
    int32_t denominator = 0;
    uint32_t multiplier;
    
    if (1u == (ptrWdConfig->centroidConfig & CY_CAPSENSE_CENTROID_NUMBER_MASK))
    {
        /* Find maximum signal */
        ptrSnsCxt = ptrWdConfig->ptrSnsContext;
        for (snsIndex = 0u; snsIndex < snsCount; snsIndex++)
        {
            if (ptrSnsCxt->diff > maxDiff)
            {
                maxDiff = ptrSnsCxt->diff;
            }
            ptrSnsCxt++;
        }
        
        /* Find index of sensor with maximum signal */
        ptrSnsCxt = ptrWdConfig->ptrSnsContext;
        for (snsIndex = 0u; snsIndex < snsCount; snsIndex++)
        {
            /* Potential maximum */
            if (maxDiff == ptrSnsCxt->diff)
            {
                /* Get sum of differences around maximum */
                diffM = (snsIndex > 0u) ? (ptrSnsCxt - 1u)->diff : ptrWdConfig->ptrSnsContext[snsCount - 1u].diff;
                diffP = (snsIndex < (snsCount - 1u)) ? (ptrSnsCxt + 1u)->diff : ptrWdConfig->ptrSnsContext[0u].diff;
                sum = ptrSnsCxt->diff + diffM + diffP;
                if (maxSum < sum)
                {
                    /* New maximum */
                    maxIndex = snsIndex;
                    maxSum = sum;
                    numerator = (int32_t)diffP - (int32_t)diffM;
                }
            }
            ptrSnsCxt++;
        }

        /* Calculate position */
        multiplier = ((uint32_t)ptrWdConfig->xResolution << 8u) / snsCount;
        
        denominator = (int32_t)maxSum;
        denominator = ((numerator * (int32_t)multiplier) / denominator) + ((int32_t)maxIndex * (int32_t)multiplier);
        if (denominator < 0)
        {
            denominator += ((int32_t)snsCount * (int32_t)multiplier);
        }
        /* Round result and shift 8 bits left */
        newTouch->numPosition = 1u;
        newTouch->ptrPosition[0u].x = CY_LO16(((uint32_t)denominator + CY_CAPSENSE_CENTROID_ROUND_VALUE) >> 8u);
    }
    else
    {
        /* This is a place holder for local maximum searching when number of centroids could be more than one */
    }
}


