dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_centroid.c
/*******************************************************************************
* Function Name: Cy_CapSense_DpAdvancedCentroidTouchpad
****************************************************************************//**
*
* Finds touch position of a CSD touchpad widget using an advanced centroid 
* algorithm.
*
* This function is able to detect two touch positions using a centroid algorithm
* with matrix 5*5 of sensors and virtual sensors on the edges. 
*
* \param newTouch
* The pointer to the touch structure where found position is stored.
*
* \param ptrWdConfig
* The pointer to the widget configuration structure.
*
*******************************************************************************/
void Cy_CapSense_DpAdvancedCentroidTouchpad(
                cy_stc_capsense_touch_t * newTouch,
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t i;
    cy_stc_capsense_sensor_context_t * ptrSnsIndex = ptrWdConfig->ptrSnsContext;
    uint16_t * ptrDiffIndex = ptrWdConfig->ptrCsdTouchBuffer;
    cy_stc_capsense_advanced_centroid_config_t advCfg;
    
    advCfg.fingerTh = ptrWdConfig->ptrWdContext->fingerTh;
    advCfg.penultimateTh = ptrWdConfig->advConfig.penultimateTh;
    advCfg.virtualSnsTh = ptrWdConfig->advConfig.virtualSnsTh;
    advCfg.resolutionX = ptrWdConfig->xResolution;
    advCfg.resolutionY = ptrWdConfig->yResolution;
    advCfg.snsCountX = ptrWdConfig->numCols;
    advCfg.snsCountY = ptrWdConfig->numRows;
    advCfg.crossCouplingTh = ptrWdConfig->advConfig.crossCouplingTh;
    advCfg.edgeCorrectionEn = 0u;
    advCfg.twoFingersEn = 0u;
    
    if ((ptrWdConfig->centroidConfig & CY_CAPSENSE_CENTROID_NUMBER_MASK) > CY_CAPSENSE_POSITION_ONE)
    {
        advCfg.twoFingersEn = 1u;
    }
    if (0u != (ptrWdConfig->centroidConfig & CY_CAPSENSE_EDGE_CORRECTION_MASK))
    {
        advCfg.edgeCorrectionEn = 1u;
    }
    for (i = 0u; i < ptrWdConfig->numSns; i++)
    {
        ptrDiffIndex[i] = ptrSnsIndex[i].diff;
    }
    
    Cy_CapSense_AdvancedCentroidGetTouchCoordinates_Lib(
                &advCfg, 
                ptrWdConfig->ptrCsdTouchBuffer, 
                newTouch);
}


/*******************************************************************************
* Function Name: Cy_CapSense_DpFindLocalMaxDd
****************************************************************************//**
*
* Finds up to 5 local maximums for CSX Touchpad.
*
* This function takes an array of differences of the specified widget and 
* finds up to five local maximums. The found maximums are stored in the CSX buffer
* ptrCsxTouchBuffer \ref cy_stc_capsense_csx_touch_buffer_t.
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
*******************************************************************************/
void Cy_CapSense_DpFindLocalMaxDd(
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    cy_stc_capsense_widget_context_t * ptrWdCxt = ptrWdConfig->ptrWdContext;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt =  ptrWdConfig->ptrSnsContext;
    uint32_t thresholdOff = (uint32_t)ptrWdCxt->fingerTh - ptrWdCxt->hysteresis;
    uint32_t thresholdOn = (uint32_t)ptrWdCxt->fingerTh + ptrWdCxt->hysteresis;
    uint16_t currDiff;
    uint8_t rx;
    uint8_t tx;
    uint8_t snsShift;
    uint8_t lastRx = ptrWdConfig->numCols - 1u;
    uint8_t lastTx = ptrWdConfig->numRows - 1u;
    uint32_t proceed = 0u;
    uint32_t touchNum = 0u;
    cy_stc_capsense_position_t * ptrNewPeak = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[0u];

    for (rx = CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS; rx-- > 0u;)
    {
        ptrNewPeak[rx].id = CY_CAPSENSE_CSX_TOUCHPAD_ID_UNDEFINED;
    }
    
    ptrNewPeak = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[0u];
    /* Go through all Rx electrodes */
    for (rx = 0u; rx <= lastRx; rx++)
    {
        /* 
        * Go through all Tx and RX (changed above) electrodes intersections 
        * and check whether the local maximum requirement is met.
        */
        for (tx = 0u; tx <= lastTx; tx++)
        {
            proceed = 0u;
            currDiff = ptrSnsCxt->diff;
            if (thresholdOff <= (uint32_t)currDiff)
            {
                /* 
                * Check local maximum requirement: Comparing raw count 
                * of a local maximum candidate with raw counts of sensors 
                * from the previous row.
                */
                if (rx > 0u)
                {
                    /* Sensor(i-1, j+1) */
                    snsShift = lastTx;
                    if ((tx < lastTx) && (currDiff <= (ptrSnsCxt - snsShift)->diff))
                    {
                        proceed = 1u;
                    }
                    if (0u == proceed)
                    {
                        /* Sensor(i-1, j) */
                        snsShift++;
                        if (currDiff <= (ptrSnsCxt - snsShift)->diff)
                        {
                            proceed = 1u;
                        }
                    }
                    if (0u == proceed)
                    {
                        /* Sensor(i-1, j-1) */
                        snsShift++;
                        if ((tx > 0u) && (currDiff <= (ptrSnsCxt - snsShift)->diff))
                        {
                            proceed = 1u;
                        }
                    }
                }
                /* 
                * Check local maximum requirement: Comparing raw count 
                * of a local maximum candidate with raw counts of sensors 
                * from the next row. 
                */
                if ((0u == proceed) && (rx < lastRx))
                {
                    /* Sensor(i+1, j+1) */
                    snsShift = lastTx + 2u;
                    if ((tx < lastTx) && (currDiff < (ptrSnsCxt + snsShift)->diff))
                    {
                        proceed = 1u;
                    }
                    if (0u == proceed)
                    {
                        /* Sensor(i+1, j) */
                        snsShift--;
                        if (currDiff < (ptrSnsCxt + snsShift)->diff)
                        {
                            proceed = 1u;
                        }
                    }
                    if (0u == proceed)
                    {
                        /* Sensor(i+1, j-1) */
                        snsShift--;
                        if ((tx > 0u) && (currDiff < (ptrSnsCxt + snsShift)->diff))
                        {
                            proceed = 1u;
                        }
                    }
                }
                /* 
                * Check local maximum requirement: Comparing raw count 
                * of a local maximum candidate with raw counts of sensors 
                * from the same row Sensor(i, j+1). */
                if ((0u == proceed) && (tx < lastTx))
                {
                    if (currDiff < (ptrSnsCxt + 1u)->diff)
                    {
                        proceed = 1u;
                    }
                }
                /* Sensor(i, j-1) */
                if ((0u == proceed) && (tx > 0u))
                {
                    if (currDiff <= (ptrSnsCxt - 1u)->diff)
                    {
                        proceed = 1u;
                    }
                }
                /* Add local maximum to the touch structure if there is room. */
                if (0u == proceed)
                {
                    ptrNewPeak->x = rx;
                    ptrNewPeak->y = tx;
                    if (currDiff < thresholdOn)
                    {
                        ptrNewPeak->id |= CY_CAPSENSE_CSX_TOUCHPAD_ID_ON_FAIL;
                    }
                    touchNum++;
                    ptrNewPeak++;
                }
            }
            ptrSnsCxt++;
            if (touchNum >= CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS)
            {
                break;
            }
        }
        if (touchNum >= CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS)
        {
            break;
        }
    }
    ptrWdConfig->ptrCsxTouchBuffer->newPeakNumber = (uint8_t)touchNum;
}


