dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_centroid.c
/*******************************************************************************
* Function Name: Cy_CapSense_DpCalcTouchPadCentroid
****************************************************************************//**
*
* Calculates the position for each local maximum using the 3x3 algorithm.
*
* This function calculates position coordinates of found local maximums. 
* The found positions are stored in the CSX buffer ptrCsxTouchBuffer 
* \ref cy_stc_capsense_csx_touch_buffer_t.
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
*******************************************************************************/
void Cy_CapSense_DpCalcTouchPadCentroid(
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    cy_stc_capsense_sensor_context_t * ptrSnsCxt =  ptrWdConfig->ptrSnsContext;
    uint8_t number;
    uint8_t i;
    uint8_t j;
    uint32_t lastRx = (uint32_t)ptrWdConfig->numCols - 1u;
    uint32_t lastTx = (uint32_t)ptrWdConfig->numRows - 1u;
    uint16_t centroid[3u][3u];
    int32_t weightedSumX;
    int32_t weightedSumY;
    uint32_t totalSum;
    uint32_t multiplierX;
    uint32_t offsetX;
    uint32_t multiplierY;
    uint32_t offsetY;
    uint32_t touchNum = ptrWdConfig->ptrCsxTouchBuffer->newPeakNumber;
    cy_stc_capsense_position_t * ptrNewPeak = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[0];

    for(number = 0u; number < touchNum; number++)
    {
        /* Set the sensor pointer to the local maximum sensor */
        ptrSnsCxt =  ptrWdConfig->ptrSnsContext;
        ptrSnsCxt += (ptrNewPeak->y + (ptrNewPeak->x * ptrWdConfig->numRows));

        /* Prepare 3x3 centroid two dimensional array */
        /* Fill each row */
        for (i = 0u; i < CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_LENGTH; i++)
        {
            /* 
            * The first  condition could be valid only when local max on the first row (0 row) of Touchpad
            * The second condition could be valid only when local max on the last row of Touchpad
            * Then corresponding row (zero or the last) of 3x3 array is initialized to 0u 
            */
            if (((((int32_t)ptrNewPeak->x - 1) + (int32_t)i) < 0) ||
                ((((int32_t)ptrNewPeak->x - 1) + (int32_t)i) > (int32_t)lastRx))
            {
                centroid[CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_PREVIOUS][i] = 0u;
                centroid[CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_CENTER][i] = 0u;
                centroid[CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_NEXT][i] = 0u;
            }
            else
            {
                /* Fill each column */
                for (j = 0u; j < CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_LENGTH; j++)
                {
                    /* 
                    * The first condition could be valid only when local max 
                    * on the first column (0 row) of Touchpad. The second 
                    * condition could be valid only when local max on the last 
                    * column of Touchpad. Then corresponding column (zero or 
                    * the last) of 3x3 array is initialized to 0u.
                    */
                    if (((((int32_t)ptrNewPeak->y - 1) + (int32_t)j) < 0) ||
                        ((((int32_t)ptrNewPeak->y - 1) + (int32_t)j) > (int32_t)lastTx))
                    {
                        centroid[j][i] = 0u;
                    }
                    else
                    {
                        centroid[j][i] = (uint16_t)(ptrSnsCxt + (((i - 1u) * ptrWdConfig->numRows) + (j - 1u)))->diff; //MISRA?
                    }
                }
            }
        }

        weightedSumX = 0;
        weightedSumY = 0;
        totalSum = 0u;

        /* Calculate centroid */
        for (i = 0u; i < CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_LENGTH; i++)
        {
            for (j = 0u; j < CY_CAPSENSE_CSX_TOUCHPAD_CENTROID_LENGTH; j++)
            {
                totalSum += centroid[i][j];
                weightedSumX += (int32_t)centroid[i][j] * ((int32_t)j - 1);
                weightedSumY += (int32_t)centroid[i][j] * ((int32_t)i - 1);
            }
        }

        /* The X position is calculated.
        * The weightedSumX value depends on a finger position shifted regarding 
        * the X electrode (ptrNewTouches.x).
        * The multiplier ptrWdConfig->xCentroidMultiplier is a short from:
        * CY_CAPSENSE_TOUCHPAD0_X_RESOLUTION * 256u) / (CY_CAPSENSE_TOUCHPAD0_NUM_RX - CONFIG))
        * where CONFIG = 0 or 1 depends on TouchpadMultiplerMethod parameter.
        */
        /* Calculate position */
        multiplierX = (uint32_t)ptrWdConfig->xResolution << 8u;
        multiplierY = (uint32_t)ptrWdConfig->yResolution << 8u;
        if (0u == (ptrWdConfig->centroidConfig & CY_CAPSENSE_CALC_METHOD_MASK))
        {
            multiplierX /= lastRx;
            offsetX = 0u;
            multiplierY /= lastTx;
            offsetY = 0u;
        }
        else
        {
            multiplierX /= (lastRx + 1u);
            offsetX = multiplierX >> 1u;
            multiplierY /= (lastTx + 1u);
            offsetY = multiplierY >> 1u;
        }

        weightedSumX = ((weightedSumX * (int32_t)multiplierX) / (int32_t)totalSum) +
                        ((((int32_t)ptrNewPeak->x) * (int32_t)multiplierX) + (int32_t)offsetX);

        /* The X position is rounded to the nearest integer value and normalized to the resolution range */
        ptrNewPeak->x = CY_LO16(((uint32_t)weightedSumX + CY_CAPSENSE_CENTROID_ROUND_VALUE) >> 8u);
        /* The Y position is calculated.
        * The weightedSumY value depends on a finger position shifted regarding the Y electrode (ptrWdConfig->ptrNewTouches.y)
        * The multiplier ptrWdConfig->yCentroidMultiplier is a short from:
        * CY_CAPSENSE_TOUCHPAD0_Y_RESOLUTION * 256u) / (CY_CAPSENSE_TOUCHPAD0_NUM_TX - CONFIG))
        * where CONFIG = 0 or 1 depends on TouchpadMultiplerMethod parameter
        */
        weightedSumY = ((weightedSumY * (int32_t)multiplierY) / (int32_t)totalSum) +
                        ((((int32_t)ptrNewPeak->y) * (int32_t)multiplierY) + (int32_t)offsetY);

        /* The Y position is rounded to the nearest integer value and normalized to the resolution range */
        ptrNewPeak->y = CY_LO16(((uint32_t)weightedSumY + CY_CAPSENSE_CENTROID_ROUND_VALUE) >> 8u);

        /* The z value is a sum of raw counts of sensors that form 3x3 matrix with a local maximum in the center */
        ptrNewPeak->z = CY_LO8(totalSum >> CY_CAPSENSE_CSX_TOUCHPAD_Z_SHIFT);
        ptrNewPeak++;
    }
}


