dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_centroid.c
/*******************************************************************************
* Function Name: Cy_CapSense_DpTouchTracking
****************************************************************************//**
*
* Tracks touches.
*
* This function tracks the found touches:
* - associates them with previous touches applying the Hungarian algorithm.
* - applies debounce filters.
* - suppresses excessive touches.
*
* The final touch data are stored in the CSX buffer ptrCsxTouchBuffer 
* \ref cy_stc_capsense_csx_touch_buffer_t. This function should be called 
* each scan cycle even when touch is not detected.
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
*******************************************************************************/
void Cy_CapSense_DpTouchTracking(
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t i;
    
    cy_stc_capsense_position_t * ptrNewPeak;
    cy_stc_capsense_position_t * ptrOldPeak;
        
    uint32_t newTouchNum = ptrWdConfig->ptrCsxTouchBuffer->newPeakNumber;
    uint32_t oldTouchNum = ptrWdConfig->ptrCsxTouchHistory->oldPeakNumber;

    int8_t * fingerPosIndex = &ptrWdConfig->ptrCsxTouchBuffer->fingerPosIndexMap[0u];
    
    if ((0u != newTouchNum) || (0u != oldTouchNum))
    {
        /* Initialize variables */
        ptrWdConfig->ptrCsxTouchBuffer->newActiveIdsMask = 0u;
        /* Getting active touch IDs from previous scan */
        ptrWdConfig->ptrCsxTouchHistory->oldActiveIdsMask = 0u;
        
        ptrOldPeak = &ptrWdConfig->ptrCsxTouchHistory->oldPeak[0u];
        for (i = 0u; i < oldTouchNum; i++)
        {
            ptrWdConfig->ptrCsxTouchHistory->oldActiveIdsMask |= (uint8_t)(1u << ptrOldPeak->id);
            ptrOldPeak++;
        }

        if (0u < newTouchNum)
        {
            if (0u == oldTouchNum)
            {
                /* If the previous touch tracking had not any touches */
                for (i = 0u; i < newTouchNum; i++)
                {
                    /* Initializes a new touch, set ID to next value and Age to 0 */
                    Cy_CapSense_NewTouch(i, ptrWdConfig);
                }
            }
            else
            {
                /* Don't call Hungarian for 1 current and 1 previous touch */
                fingerPosIndex[0u] = 0;
                if ((1u != newTouchNum) || (1u != oldTouchNum))
                {
                    Cy_CapSense_Hungarian(ptrWdConfig);
                }
                /* General case */
                if (newTouchNum >= oldTouchNum)
                {
                    ptrOldPeak = &ptrWdConfig->ptrCsxTouchHistory->oldPeak[0u];
                    for (i = 0u; i < oldTouchNum; i++)
                    {
                        if (ptrWdConfig->ptrCsxTouchHistory->velocity < Cy_CapSense_CalcDistance((uint32_t)fingerPosIndex[i], i, ptrWdConfig))
                        {
                            /* Set new ID and reset Age */
                            Cy_CapSense_NewTouch((uint32_t)fingerPosIndex[i], ptrWdConfig);
                        }
                        else
                        {
                            /* Set ID to previous value and increase Age */
                            ptrWdConfig->ptrCsxTouchBuffer->newActiveIdsMask |= (uint8_t)(1u << (ptrOldPeak->id));
                            Cy_CapSense_TransferTouch((uint32_t)fingerPosIndex[i], i, ptrWdConfig);
                        }
                        ptrOldPeak++;
                    }
                }
                else
                {
                    ptrOldPeak = &ptrWdConfig->ptrCsxTouchHistory->oldPeak[0u];
                    for (i = 0u; i < newTouchNum; i++)
                    {
                        if (ptrWdConfig->ptrCsxTouchHistory->velocity < Cy_CapSense_CalcDistance(i, (uint32_t)fingerPosIndex[i], ptrWdConfig))
                        {
                            /* Set new ID and reset Age. */
                            Cy_CapSense_NewTouch(i, ptrWdConfig);
                        }
                        else
                        {
                            /* Set ID to previous value and increase Age. */
                            ptrWdConfig->ptrCsxTouchBuffer->newActiveIdsMask |= (uint8_t)(1u << (ptrOldPeak->id));
                            Cy_CapSense_TransferTouch(i, (uint32_t)fingerPosIndex[i], ptrWdConfig);
                        }
                        ptrOldPeak++;
                    }
                }
                /* Added new fingers, they need to assign ID */
                if (newTouchNum > oldTouchNum)
                {
                    /* Search new fingers */
                    ptrNewPeak = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[0u];
                    for (i = 0u; i < newTouchNum; i++)
                    {
                        /* New finger found */
                        if (0u != (ptrNewPeak->id & CY_CAPSENSE_CSX_TOUCHPAD_ID_UNDEFINED))
                        {
                            Cy_CapSense_NewTouch(i, ptrWdConfig);
                        }
                        ptrNewPeak++;
                    }
                }
            }

            Cy_CapSense_TouchDownDebounce(ptrWdConfig);
        }
        
        Cy_CapSense_SortByAge(ptrWdConfig);
        newTouchNum = ptrWdConfig->ptrCsxTouchBuffer->newPeakNumber;

        /* Store new touches as old touches */
        ptrWdConfig->ptrCsxTouchHistory->oldPeakNumber = (uint8_t)newTouchNum;
        ptrWdConfig->ptrCsxTouchHistory->oldActiveIdsMask = ptrWdConfig->ptrCsxTouchBuffer->newActiveIdsMask;
        ptrNewPeak = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[0u];
        ptrOldPeak = &ptrWdConfig->ptrCsxTouchHistory->oldPeak[0u];
        for (i = newTouchNum; i-- > 0u;)
        {
            Cy_CapSense_CopyTouchRecord(ptrOldPeak, ptrNewPeak);
            ptrNewPeak++;
            ptrOldPeak++;
        }
    }
 }

/*******************************************************************************
* Function Name: Cy_CapSense_TransferTouch
****************************************************************************//**
*
* Transfers a touch from history array into active current array.
*
* This function transfers touch specified by oldIndex from history touch array
* by copying its ID, increments age and decrements debounce (if debounce > 0) 
* parameters into currently active touch structure
*
* \param newIndex 
* The touch index of touch array in the active touch structure.
*
* \param oldIndex 
* The touch index of touch array in the history touch structure.
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
*******************************************************************************/
static void Cy_CapSense_TransferTouch(
                uint32_t newIndex, 
                uint32_t oldIndex, 
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t touchId;
    uint32_t touchAge;
    uint32_t touchDebounce;
    cy_stc_capsense_position_t * ptrNewPeak = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[newIndex];
    cy_stc_capsense_position_t * ptrOldPeak = &ptrWdConfig->ptrCsxTouchHistory->oldPeak[oldIndex];

    touchId = (uint32_t)ptrOldPeak->id & CY_CAPSENSE_CSX_TOUCHPAD_ID_MASK;
    touchAge = ((uint32_t)ptrOldPeak->z & CY_CAPSENSE_CSX_TOUCHPAD_AGE_MASK) >> CY_CAPSENSE_CSX_TOUCHPAD_BYTE_SHIFT;
    touchDebounce = ((uint32_t)ptrOldPeak->id & CY_CAPSENSE_CSX_TOUCHPAD_DEBOUNCE_MASK) >> CY_CAPSENSE_CSX_TOUCHPAD_BYTE_SHIFT;
    
    /* Increase AGE by 1 if possible */
    if (touchAge < CY_CAPSENSE_CSX_TOUCHPAD_MAX_AGE)
    {
        touchAge++;
    }
    /* Decrement Debounce counter if possible */
    if (touchDebounce > 0u)
    {
        touchDebounce--;
    }
    
