dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_centroid.c
    ptrNewPeak->id = (uint16_t)(touchId | (uint16_t)(touchDebounce << CY_CAPSENSE_CSX_TOUCHPAD_BYTE_SHIFT));
    ptrNewPeak->z &= (uint16_t)~CY_CAPSENSE_CSX_TOUCHPAD_AGE_MASK;
    ptrNewPeak->z |= (uint16_t)(touchAge << CY_CAPSENSE_CSX_TOUCHPAD_BYTE_SHIFT);
}


/*******************************************************************************
* Function Name: Cy_CapSense_NewTouch
****************************************************************************//**
*
* Set ID, age and on debounce parameters for a new touch.
*
* If raw count is lower than the finger-On-Threshold,
* then the corresponding touch is marked with CY_CAPSENSE_CSX_TOUCHPAD_ID_ON_FAIL
* in the ID and will be deleted from the new touch structure in Cy_CapSense_SortByAge()
* (new touch structure is reorganized in this case).
*
* \param newIndex
* The touch index of touch array in the active touch structure.
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
*******************************************************************************/
static void Cy_CapSense_NewTouch(
                uint32_t newIndex,  
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t idx;
    cy_stc_capsense_position_t * ptrNewPeak = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[newIndex];
    
    /* Touch is not accepted */
    if (0u == (ptrNewPeak->id & CY_CAPSENSE_CSX_TOUCHPAD_ID_ON_FAIL))
    {
        /* Create a bit map of ID's currently used and previously used and search for the new lowest ID */
        idx = Cy_CapSense_GetLowestId(ptrWdConfig->ptrCsxTouchHistory->oldActiveIdsMask | 
                ptrWdConfig->ptrCsxTouchBuffer->newActiveIdsMask);
        
        /* Indicate that ID is now taken */
        ptrWdConfig->ptrCsxTouchBuffer->newActiveIdsMask |= (uint8_t)(1u << idx);
        
        /* Set AGE */
        ptrNewPeak->z &= (uint16_t)~CY_CAPSENSE_CSX_TOUCHPAD_AGE_MASK;
        ptrNewPeak->z |= CY_CAPSENSE_CSX_TOUCHPAD_AGE_START;
        
        /* Set ID and Debounce */
        ptrNewPeak->id = (uint16_t)idx | (uint16_t)(((uint16_t)ptrWdConfig->ptrWdContext->onDebounce - 1u) << CY_CAPSENSE_CSX_TOUCHPAD_BYTE_SHIFT);
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_GetLowestId
****************************************************************************//**
*
* Returns the lowest available free touch ID.
*
* \param idMask 
* The mask of IDs used in active and history touch structures.
*
* \return   
* Returns the lowest available touch ID. If no ID is available,
* CY_CAPSENSE_CSX_TOUCHPAD_ID_ABSENT is returned.
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_CapSense_GetLowestId(uint8_t idMask)
{
    uint32_t idx;
    uint32_t touchId = CY_CAPSENSE_CSX_TOUCHPAD_ID_ABSENT;

    /* Search for the lowest available ID */
    for (idx = CY_CAPSENSE_CSX_TOUCHPAD_ID_MIN; idx <= CY_CAPSENSE_CSX_TOUCHPAD_ID_MAX; idx++)
    {
        /* Determine whether the new ID is available */
        if (0u == (idMask & 1u))
        {
            touchId = idx;
            break;
        }

        idMask >>= 1u;
    }

    /* Return an indicator of failure */
    return (uint8_t)(touchId);
}


/*******************************************************************************
* Function Name: Cy_CapSense_TouchDownDebounce
****************************************************************************//**
*
* Handles touchdown debouncing.
*
* Even if a new touch is detected, it is not considered as active until 
* debounce counter has not reached zero. If debounce counter has reached zero,
* the touchdown mask is cleared. Otherwise the age of the new finger is cleared
* (it is considered as not active).
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CapSense_TouchDownDebounce(
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t i;
    cy_stc_capsense_position_t * ptrNewPeak = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[0u];

    for (i = 0u; i < ptrWdConfig->ptrCsxTouchBuffer->newPeakNumber; i++)
    {
        /* If it is a touchdown debouncing finger its age is set to zero */
        if (0u != (ptrNewPeak->id & CY_CAPSENSE_CSX_TOUCHPAD_DEBOUNCE_MASK))
        {
            /* Set the age to zero - finger is not active */
            ptrNewPeak->z &= (uint16_t)~CY_CAPSENSE_CSX_TOUCHPAD_AGE_MASK;
        }
        ptrNewPeak++;
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_CalcDistance
****************************************************************************//**
*
* Calculates squared distance between history and active touch structures 
* pointed by the input parameters.
*
* \param newIndex      
* The index of touch in the active touch structure.
*
* \param oldIndex      
* The index of touch in the history touch structure.
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
* \return 
* Returns the squared distance.
*
*******************************************************************************/
static uint32_t Cy_CapSense_CalcDistance(
                uint32_t newIndex, 
                uint32_t oldIndex,
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    cy_stc_capsense_position_t * ptrNewPeak = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[newIndex];
    cy_stc_capsense_position_t * ptrOldPeak = &ptrWdConfig->ptrCsxTouchHistory->oldPeak[oldIndex];
    
    int32_t xDistance = (int32_t)(ptrOldPeak->x) - (int32_t)(ptrNewPeak->x);
    int32_t yDistance = (int32_t)(ptrOldPeak->y) - (int32_t)(ptrNewPeak->y);
    
    xDistance *= xDistance;
    yDistance *= yDistance;
    
    return ((uint32_t)xDistance + (uint32_t)yDistance);
}


