dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_centroid.c
/*******************************************************************************
* Function Name: Cy_CapSense_Hungarian
****************************************************************************//**
*
* Executes the Hungarian Method on a distance map to track motion of two 
* touch sets (old touches vs new touches).
*
* This function uses the Hungarian method described in specification 001-63362.
* There is no bound checking on the parameters. It is the calling function's
* responsibility to ensure parameter validity.
* The function output is a fingerPosIndexMap array stored in the CSX buffer 
* where associations between the previous and current touches are returned.
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
* 
*******************************************************************************/
static void Cy_CapSense_Hungarian(
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    cy_stc_capsense_csx_touch_buffer_t * ptrBuffer = ptrWdConfig->ptrCsxTouchBuffer;
    /*
    * Number of elements in column of distanceMap matrix. This value must
    * be greater than or equal to 1.
    */
    int32_t * col = &ptrBuffer->colMap[0u];
    /* 
    * Number of elements in row of distanceMap matrix. This value must be
    * greater than or equal to colCount. 
    */
    int32_t * row = &ptrBuffer->rowMap[0u];
    int32_t * mins = &ptrBuffer->minsMap[0u];
    int8_t * links = &ptrBuffer->linksMap[0u];
    int8_t * visited = &ptrBuffer->visitedMap[0u];
    int8_t * markIndices = &ptrBuffer->markIndicesMap[0u];
    /*
    * The 2-dimensional map of distances between the nodes in each
    * coordinate set. The 1st index of distanceMap corresponds to nodes
    * in the 1st coordinate data set, and the 2nd index of distanceMap
    * corresponds to the 2nd coordinate data set. Each element in
    * distanceMap is the square of the distance between the
    * corresponding coordinates in the 1st and 2nd data set.
    */    
    int32_t * distance = &ptrBuffer->distanceMap[0u];
    
    int32_t delta = 0;
    int32_t colValue = 0;
    int32_t markedI = 0;
    int32_t markedJ = 0;
    int32_t i = 0;
    int32_t iIndex = 0;
    int32_t j = 0;
    int32_t jIndex = 0;

    uint32_t rowCount = ptrBuffer->newPeakNumber;
    uint32_t colCount = ptrWdConfig->ptrCsxTouchHistory->oldPeakNumber;
    
    /* Fill distance map */
    if (rowCount >= colCount)
    {
        for (i = (int32_t)rowCount; i-- > 0; )
        {
            for (j = (int32_t)colCount; j-- > 0; )
            {
                distance[((uint32_t)i * CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS) + (uint32_t)j] = (int32_t)Cy_CapSense_CalcDistance((uint32_t)i, (uint32_t)j, ptrWdConfig);
            }
        }
    }
    else
    {
        for (i = (int32_t)colCount; i-- > 0;)
        {
            for (j = (int32_t)rowCount; j-- > 0;)
            {
                distance[((uint32_t)i * CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS) + (uint32_t)j] = (int32_t)Cy_CapSense_CalcDistance((uint32_t)j, (uint32_t)i, ptrWdConfig);
            }
        }
        colValue = (int32_t)colCount;
        colCount = rowCount;
        rowCount = (uint32_t)colValue;
    }

    (void)memset(col, 0, (uint32_t)colCount * 4u);

    /* Initialize row and markIndices arrays */
    for (i = (int32_t)rowCount; i-- > 0;)
    {
        row[i] = 0;
        markIndices[i] = -1;
    }
    
    /* Go through all columns */
    for (i = (int32_t)colCount; i-- > 0;)
    {
        /* Initialize visited, links, mins arrays. They are used for every column */
        for (iIndex = (int32_t)rowCount; iIndex-- > 0;)
        {
            visited[iIndex] = 0;
            links[iIndex] = -1;
            mins[iIndex] = INT32_MAX;
        }

        /* Next two variables are used to mark column and row */
        markedI = i;
        markedJ = -1;

        while (markedI != -1)
        {
            j = -1;
            colValue = col[markedI];

            /* Go through all rows */
            for (jIndex = (int32_t)rowCount; jIndex-- > 0;)
            {
                if (visited[jIndex] == 0)
                {
                    delta = distance[((uint32_t)jIndex * CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS) + (uint32_t)markedI] - row[jIndex] - colValue;

                    /* Find the minimum element index in column i */
                    if (mins[jIndex] > delta)
                    {
                        mins[jIndex] = delta;
                        links[jIndex] = (int8_t)markedJ;
                    }

                    if ((j == -1) || (mins[jIndex] < mins[j]))
                    {
                        j = jIndex;
                    }
                }
            }

            delta = mins[j];

            /* Go through all rows */
            for (jIndex = (int32_t)rowCount; jIndex-- > 0;)
            {
                if (visited[jIndex] != 0)
                {
                    col[markIndices[jIndex]] += delta;
                    row[jIndex] -= delta;
                }
                else
                {
                    mins[jIndex] -= delta;
                }
            }

            col[i] +=  delta;

            visited[j] = 1;
            markedJ = j;
            markedI = markIndices[j];
        }

        while (links[j] != -1)
        {
            markIndices[j] = markIndices[links[j]];
            j = links[j];
        }

        markIndices[j] = (int8_t)i;
    }

    /* Provide an association between two sets of touches */
    for (j = (int32_t)rowCount; j-- > 0;)
    {
        if (markIndices[j] != -1)
        {
            ptrBuffer->fingerPosIndexMap[markIndices[j]] = (int8_t)j;
        }
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_SortByAge
****************************************************************************//**
*
* Sorts the new touch array by:
* 1. age (in decrementing order) 
* and 
* 2. id (in incrementing order) fields.
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CapSense_SortByAge(
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t i;
    uint32_t j;
    cy_stc_capsense_position_t tempPeak;
    cy_stc_capsense_position_t * ptrNewPeak = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[0u];
    cy_stc_capsense_position_t * ptrNewPeakJ;
    uint32_t newTouchNum = ptrWdConfig->ptrCsxTouchBuffer->newPeakNumber;

