dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_centroid.c
    /*
     * Delete failed touch by coping (rewriting) the last touch content to the failed touch.
     * If the last touch record is invalid, try the penultimate touch record and so on.
     */
    for (i = 0u; i < newTouchNum; i++)
    {
        if ((ptrNewPeak->id & CY_CAPSENSE_CSX_TOUCHPAD_ID_MASK) > CY_CAPSENSE_CSX_TOUCHPAD_ID_MAX)
        {
            for (j = (newTouchNum - 1u); j > i; j--)
            {
                /* 
                * Check the touch records from the last to the current.
                * If the touch record is valid, then replace the current touch record.
                */
                ptrNewPeakJ = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[j];
                if ((ptrNewPeakJ->id & CY_CAPSENSE_CSX_TOUCHPAD_ID_MASK) <= CY_CAPSENSE_CSX_TOUCHPAD_ID_MAX)
                {
                    Cy_CapSense_CopyTouchRecord(ptrNewPeak, ptrNewPeakJ);

                    /* Finish the loop. The valid touch record is found and copied. */
                    break;
                }
                else
                {
                    /* Decrement the number of touch records.
                     * The last touch record is invalid - try the penultimate touch record.
                     */
                    newTouchNum--;
                }
            }

            /* Decrement the number of touch records.
             * The last touch record is valid and copied to the current position (i)
             */
            newTouchNum--;
        }
        ptrNewPeak++;
    }

    /* Set new number of touches */
    ptrWdConfig->ptrCsxTouchBuffer->newPeakNumber = (uint8_t)newTouchNum;

    ptrNewPeak = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[0u];
    /* Sort new touches structure */
    for (i = 0u; i < newTouchNum; i++)
    {
        for (j = (i + 1u); j < newTouchNum; j++)
        {
            ptrNewPeakJ = &ptrWdConfig->ptrCsxTouchBuffer->newPeak[j];
            /* If next touches have higher age or lower id with the same age then swap touches */
            if (((ptrNewPeak->z & CY_CAPSENSE_CSX_TOUCHPAD_AGE_MASK) < (ptrNewPeakJ->z & CY_CAPSENSE_CSX_TOUCHPAD_AGE_MASK)) || 
                (((ptrNewPeak->z & CY_CAPSENSE_CSX_TOUCHPAD_AGE_MASK) == (ptrNewPeakJ->z & CY_CAPSENSE_CSX_TOUCHPAD_AGE_MASK)) && (ptrNewPeak->id > ptrNewPeakJ->id)))
            {
                /* Swap touches */
                Cy_CapSense_CopyTouchRecord(&tempPeak, ptrNewPeak);
                Cy_CapSense_CopyTouchRecord(ptrNewPeak, ptrNewPeakJ);
                Cy_CapSense_CopyTouchRecord(ptrNewPeakJ, &tempPeak);
            }
        }
        ptrNewPeak++;
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_CopyTouchRecord
****************************************************************************//**
*
* Copies content from the source touch structure to the destination touch structure.
*
* \param destination 
* The pointer to the destination touch structure \ref cy_stc_capsense_position_t.
*
* \param source      
* The pointer to the source touch structure \ref cy_stc_capsense_position_t.
*
*******************************************************************************/
static void Cy_CapSense_CopyTouchRecord(
                cy_stc_capsense_position_t * destination,
                const cy_stc_capsense_position_t * source)
{
    *destination = *source;
}


/*******************************************************************************
* Function Name: Cy_CapSense_DpFilterTouchRecord
****************************************************************************//**
*
* Filters position data of every valid touch if enabled and copies data into 
* public touch array.
*
* This function checks every touch in the new touch structure. If the touch is 
* valid (valid id and age > 0), then touch is filtered if filter is enabled. 
* At the end, the corresponding fields are updated in the public touch structure.
*
* \param ptrWdConfig 
* The pointer to the widget configuration structure
* \ref cy_stc_capsense_widget_config_t.
*
*******************************************************************************/
void Cy_CapSense_DpFilterTouchRecord(
                const cy_stc_capsense_widget_config_t * ptrWdConfig)
{
    uint32_t i;
    uint32_t j;
    uint32_t reportedTouchNum = 0u;
    uint32_t peakNum = ptrWdConfig->ptrCsxTouchBuffer->newPeakNumber;
    uint32_t filterSize;
    uint32_t maxTouch;
    uint32_t newTouchFlag = 0u;
    cy_stc_capsense_position_t * ptrWdTouch = ptrWdConfig->ptrWdContext->wdTouch.ptrPosition;
    cy_stc_capsense_position_t * ptrNewPeak = ptrWdConfig->ptrCsxTouchBuffer->newPeak;
    cy_stc_capsense_position_t * ptrHistory;
    uint32_t historyFlag[CY_CAPSENSE_MAX_CENTROIDS] = {0u};
    
    /* Define number of touches that should be reported */
    for (i = 0u; i < CY_CAPSENSE_MAX_CENTROIDS; i++)
    {
        /* 
        * Age must be higher than 0 otherwise the touch does not pass 
        * debounce procedure. It exists in the array for correct
        * touch tracking and debouncing.
        */
        if ((i < peakNum) && ((ptrNewPeak->z & CY_CAPSENSE_CSX_TOUCHPAD_AGE_MASK) > 0u))
        {
            reportedTouchNum++;
        }
        ptrNewPeak++;
    }
    
    maxTouch = (uint32_t)ptrWdConfig->centroidConfig & CY_CAPSENSE_CENTROID_NUMBER_MASK;
    if (reportedTouchNum > maxTouch)
    {
        reportedTouchNum = maxTouch;
    }
    
    if (0u != (ptrWdConfig->posFilterConfig & CY_CAPSENSE_POSITION_FILTERS_MASK))
    {
        filterSize = (ptrWdConfig->posFilterConfig & CY_CAPSENSE_POSITION_FILTERS_SIZE_MASK) >>
                        CY_CAPSENSE_POSITION_FILTERS_SIZE_OFFSET;
        
        /* Go through all new touches */
        ptrNewPeak = ptrWdConfig->ptrCsxTouchBuffer->newPeak;
        for (i = 0u; i < reportedTouchNum; i++)
        {
            newTouchFlag = 0u;
            /* Find index in the history array that corresponds to the new touch */
            ptrHistory = ptrWdConfig->ptrPosFilterHistory->ptrPosition;
            for (j = 0u; j < maxTouch; j++)
            {
                /* ID must match */
                if (ptrHistory->id == ptrNewPeak->id)
                {
                    /* Filter X and Y position of touch that exists from previous scan */
                    Cy_CapSense_RunPositionFilters(ptrWdConfig, ptrNewPeak, ptrHistory);
                    /* Mark history touch as assigned */
                    historyFlag[j] = 1u;
                    newTouchFlag = 1u;
                    /* Because the touch is found and processed, go to the next new touch */
                    break;
                }
                ptrHistory += filterSize;
            }
            /* The touch is not found in history */
            if (0u == newTouchFlag)
            {
                /* Find a place to keep history and initialize it */
                ptrHistory = ptrWdConfig->ptrPosFilterHistory->ptrPosition;
                for (j = 0u; j < maxTouch; j++)
                {
                    if (0u == historyFlag[j])
                    {
                        Cy_CapSense_InitPositionFilters(ptrWdConfig->posFilterConfig, ptrNewPeak, ptrHistory);
                        historyFlag[j] = 1u;
                        /* Assignment is done; go to the next new touch */
                        break;
                    }
                    ptrHistory += filterSize;
                }
            }
            ptrNewPeak++;
        }
        /* Reset all non-assigned history IDs */
        ptrHistory = ptrWdConfig->ptrPosFilterHistory->ptrPosition;
        for (j = 0u; j < maxTouch; j++)
        {
            if (0u == historyFlag[j])
            {
                ptrHistory->id = CY_CAPSENSE_CSX_TOUCHPAD_ID_UNDEFINED;
            }
            ptrHistory += filterSize;
        }
    }
    
