dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_centroid.c
    /* Go through all touch fields in the data structure */
    ptrNewPeak = ptrWdConfig->ptrCsxTouchBuffer->newPeak;
    for (i = 0u; i < maxTouch; i++)
    {
        ptrWdTouch->id = CY_CAPSENSE_CSX_TOUCHPAD_ID_UNDEFINED;
    
        if (i < reportedTouchNum)
        {
            /* Report touch to the data structure */
            ptrWdTouch->x = ptrNewPeak->x;
            ptrWdTouch->y = ptrNewPeak->y;
            ptrWdTouch->z = ptrNewPeak->z;
            ptrWdTouch->id = ptrNewPeak->id;
        }
        ptrNewPeak++;
        ptrWdTouch++;
    }
    
    ptrWdConfig->ptrWdContext->wdTouch.numPosition = (uint8_t)reportedTouchNum;
    if (0u == reportedTouchNum)
    {
        ptrWdConfig->ptrWdContext->status &= (uint8_t)~CY_CAPSENSE_WD_ACTIVE_MASK;
    }
    else
    {
        ptrWdConfig->ptrWdContext->status = CY_CAPSENSE_WD_ACTIVE_MASK;
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_InitPositionFilters
****************************************************************************//**
*
* Initializes history of touch structures by provided current touch states.
*
* \param filterConfig
* The configuration of filters of the widget.
*
* \param ptrInput
* The pointer to the position structure that holds currently detected
* position values.
*
* \param ptrHistory
* The pointer to the position structure that holds previous historical 
* position values.
*
*******************************************************************************/
void Cy_CapSense_InitPositionFilters(
                uint32_t filterConfig,
                const cy_stc_capsense_position_t * ptrInput, 
                cy_stc_capsense_position_t * ptrHistory)
{
    cy_stc_capsense_position_t * ptrHistoryIndex = ptrHistory;
    
    if (0u != (filterConfig & CY_CAPSENSE_POSITION_MED_MASK))
    {
        *ptrHistoryIndex = *ptrInput;
        ptrHistoryIndex++;
        *ptrHistoryIndex = *ptrInput;
        ptrHistoryIndex++;
    }
    if (0u != (filterConfig & CY_CAPSENSE_POSITION_IIR_MASK))
    {
        *ptrHistoryIndex = *ptrInput;
        ptrHistoryIndex++;
    }
    if (0u != (filterConfig & CY_CAPSENSE_POSITION_AIIR_MASK))
    {
        ptrHistoryIndex->x = ptrInput->x;
        ptrHistoryIndex->y = ptrInput->y;
        ptrHistoryIndex++;
    }
    if (0u != (filterConfig & CY_CAPSENSE_POSITION_AVG_MASK))
    {
        *ptrHistoryIndex = *ptrInput;
        ptrHistoryIndex++;
    }
    if (0u != (filterConfig & CY_CAPSENSE_POSITION_JIT_MASK))
    {
        *ptrHistoryIndex = *ptrInput;
        ptrHistoryIndex++;
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_RunPositionFilters
****************************************************************************//**
*
* Applies enabled filters to position specified by ptrInput argument and stores 
* history into ptrHistory.
*
* \param filterConfig
* The configuration of filters of the widget.
*
* \param ptrInput
* The pointer to the position structure that holds currently detected
* position values.
*
* \param ptrHistory
* The pointer to the position structure that holds previous historical 
* position values.
*
*******************************************************************************/
void Cy_CapSense_RunPositionFilters(
                const cy_stc_capsense_widget_config_t * ptrWdConfig,
                cy_stc_capsense_position_t * ptrInput, 
                cy_stc_capsense_position_t * ptrHistory)
{
    uint32_t temp;
    uint32_t xPos = ptrInput->x;
    uint32_t yPos = ptrInput->y;
    cy_stc_capsense_position_t * ptrHistoryIndex = ptrHistory;
    uint32_t filterCfg = ptrWdConfig->posFilterConfig;
    uint32_t coeffIIR = (uint32_t)(filterCfg & CY_CAPSENSE_POSITION_IIR_COEFF_MASK) >> CY_CAPSENSE_POSITION_IIR_COEFF_OFFSET;
    
    if (0u != (filterCfg & CY_CAPSENSE_POSITION_MED_MASK))
    {
        temp = Cy_CapSense_FtMedian((uint32_t)ptrHistoryIndex[1u].x, (uint32_t)ptrHistoryIndex[0u].x, xPos);
        ptrHistoryIndex[1u].x = ptrHistoryIndex[0u].x;
        ptrHistoryIndex[0u].x = (uint16_t)xPos;
        xPos = temp;
        temp = Cy_CapSense_FtMedian((uint32_t)ptrHistoryIndex[1u].y, (uint32_t)ptrHistoryIndex[0u].y, yPos);
        ptrHistoryIndex[1u].y = ptrHistoryIndex[0u].y;
        ptrHistoryIndex[0u].y = (uint16_t)yPos;
        yPos = temp;
        ptrHistoryIndex++;
        ptrHistoryIndex++;
    }
    if (0u != (filterCfg & CY_CAPSENSE_POSITION_IIR_MASK))
    {
        xPos = Cy_CapSense_FtIIR1stOrder(xPos, (uint32_t)ptrHistoryIndex->x, coeffIIR);
        ptrHistoryIndex->x = (uint16_t)xPos;
        yPos = Cy_CapSense_FtIIR1stOrder(yPos, (uint32_t)ptrHistoryIndex->y, coeffIIR);
        ptrHistoryIndex->y = (uint16_t)yPos;
        ptrHistoryIndex++;
    }
    if (0u != (filterCfg & CY_CAPSENSE_POSITION_AIIR_MASK))
    {
        Cy_CapSense_AdaptiveFilterRun_Lib(&ptrWdConfig->aiirConfig, ptrHistoryIndex, &xPos, &yPos);
        ptrHistoryIndex++;
    }
    if (0u != (filterCfg & CY_CAPSENSE_POSITION_AVG_MASK))
    {
        temp = xPos;
        xPos = (xPos + ptrHistoryIndex->x) >> 1u;
        ptrHistoryIndex->x = (uint16_t)temp;
        temp = yPos;
        yPos = (yPos + ptrHistoryIndex->y) >> 1u;
        ptrHistoryIndex->y = (uint16_t)temp;
        ptrHistoryIndex++;
    }
    if (0u != (filterCfg & CY_CAPSENSE_POSITION_JIT_MASK))
    {
        xPos = Cy_CapSense_FtJitter(xPos, (uint32_t)ptrHistoryIndex->x);
        ptrHistoryIndex->x = (uint16_t)xPos;
        yPos = Cy_CapSense_FtJitter(yPos, (uint32_t)ptrHistoryIndex->y);
        ptrHistoryIndex->y = (uint16_t)yPos;
    }
    ptrInput->x = (uint16_t)xPos;
    ptrInput->y = (uint16_t)yPos;
}


/*******************************************************************************
* Function Name: Cy_CapSense_RunPositionFiltersRadial
****************************************************************************//**
*
* Applies enabled filters to position specified by the ptrInput argument and stores 
* history into ptrHistory. Filtering considers specific widget type where 
* the next value after maximum position is zero and vise versa. 
*
* \param filterConfig
* The configuration of filters of the widget.
*
* \param ptrInput
* The pointer to the position structure that holds currently detected
* position values.
*
* \param ptrHistory
* The pointer to the position structure that holds previous historical 
* position values.
*
*******************************************************************************/
void Cy_CapSense_RunPositionFiltersRadial(
                const cy_stc_capsense_widget_config_t * ptrWdConfig,
                cy_stc_capsense_position_t * ptrInput, 
                cy_stc_capsense_position_t * ptrHistory)
{
    /*
    * If new position crosses the zero point in one or another direction, 
    * the position variable with the smaller value is increased by the 
    * slider resolution. This is done for the proper filtering. For 
    * example, xResolution = 100, currPosition = 95, newPosition = 5.
    * If no actions are taken, then the average filter will give a value of 
    * 50 - which is wrong. But if the position values are adjusted as 
    * mentioned here, we will get newPosition equal 105 and the average 
    * will be 100. Later this filtered value will be adjusted further 
    * to not cross the xResolution and it will end up with 0u - which 
    * is correct average result for the provided example.
    */

    uint32_t z1;
    uint32_t z2;
    uint32_t temp;
    /* The register contains max position value, so therefore it is increased by 1 */
    uint32_t centroidResolution = (uint32_t)ptrWdConfig->xResolution + 1u;
    uint32_t halfResolution = centroidResolution >> 1u;
    uint32_t xPos = ptrInput->x;
    uint32_t yPos = 0u;
    cy_stc_capsense_position_t * ptrHistoryIndex = ptrHistory;
    uint32_t filterCfg = ptrWdConfig->posFilterConfig;
    uint32_t coeffIIR = (uint32_t)(filterCfg & CY_CAPSENSE_POSITION_IIR_COEFF_MASK) >> CY_CAPSENSE_POSITION_IIR_COEFF_OFFSET;
    
    if (0u != (filterCfg & CY_CAPSENSE_POSITION_MED_MASK))
    {
        /* Get the filter history for further zero-cross correction */
        z1 = ptrHistoryIndex[0u].x;
        z2 = ptrHistoryIndex[1u].x;
        /* Preserve the filter history without zero-cross correction */
        ptrHistoryIndex[1u].x = ptrHistoryIndex[0u].x;
        ptrHistoryIndex[0u].x = (uint16_t)xPos;
 
        /* Perform zero-cross correction */
        if (z1 > (halfResolution + xPos))
        {
            xPos += centroidResolution;
        }
        if (xPos > (halfResolution + z1))
        {
            z1 += centroidResolution;
            z2 += centroidResolution;
        }
        if (z2 > (halfResolution + z1))
        {
            z1 += centroidResolution;
            xPos += centroidResolution;
        }
        if (z1 > (halfResolution + z2))
        {
            z2 += centroidResolution;
        }

        /* Perform filtering */
        xPos = Cy_CapSense_FtMedian(z2, z1, xPos);
        /* Perform zero-cross correction of filtered position */
        if (xPos >= centroidResolution)
        {
            xPos -= centroidResolution;
        }
        ptrHistoryIndex++;
        ptrHistoryIndex++;
    }
    if (0u != (filterCfg & CY_CAPSENSE_POSITION_IIR_MASK))
    {
        /* Perform zero-cross correction */
        if (ptrHistoryIndex->x > (halfResolution + xPos))
        {
            xPos += centroidResolution;
        }
        if (xPos > (halfResolution + ptrHistoryIndex->x))
        {
            ptrHistoryIndex->x += (uint16_t)centroidResolution;
        }
        if (ptrHistoryIndex->x > xPos)
        {
            temp = ptrHistoryIndex->x - xPos;
        }
        else
        {
            temp = xPos - ptrHistoryIndex->x;
        }
        
