dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_centroid.c
        /*
        * IIR filter can accumulate a delay up to a full circle and even more.
        * This situation is not supported by the middleware. If the difference 
        * between the new position and IIR filter history is bigger than 
        * half of resolution, then all enabled position filters are reset.
        */
        if(temp >= halfResolution)
        {
            /* Perform Initialization */
            Cy_CapSense_InitPositionFilters(filterCfg, ptrInput, ptrHistory);
        }
        else
        {
            /* Perform filtering */
            xPos = Cy_CapSense_FtIIR1stOrder(xPos, (uint32_t)ptrHistoryIndex->x, coeffIIR);
            /* Perform zero-cross correction of filtered position */
            if (xPos >= centroidResolution)
            {
                xPos -= centroidResolution;
            }
            ptrHistoryIndex->x = (uint16_t)xPos;
        }
        ptrHistoryIndex++;
    }
    if (0u != (filterCfg & CY_CAPSENSE_POSITION_AIIR_MASK))
    {
        /* Perform zero-cross correction */
        if (ptrHistoryIndex->x > (halfResolution + xPos))
        {
            xPos += centroidResolution;
        }
        if (xPos > (halfResolution + ptrHistoryIndex->x))
        {
            ptrHistoryIndex->x += (uint16_t)centroidResolution;
        }
        if (ptrHistoryIndex->x > xPos)
        {
            temp = ptrHistoryIndex->x - xPos;
        }
        else
        {
            temp = xPos - ptrHistoryIndex->x;
        }
        
        /*
        * IIR filter can accumulate delay up to full circle and even more.
        * This situation is not supported by the middleware. If the difference 
        * between the new position and IIR filter history is bigger than 
        * half of resolution, then all enabled position filters are reset.
        */
        if(temp >= halfResolution)
        {
            /* Perform Initialization */
            Cy_CapSense_InitPositionFilters(filterCfg, ptrInput, ptrHistory);
        }
        else
        {
            /* Perform filtering */
            Cy_CapSense_AdaptiveFilterRun_Lib(
                        &ptrWdConfig->aiirConfig, 
                        ptrHistoryIndex, 
                        &xPos, 
                        &yPos);
            /* Perform zero-cross correction of filtered position */
            if (xPos >= centroidResolution)
            {
                xPos -= centroidResolution;
            }
            ptrHistoryIndex->x = (uint16_t)xPos;
        }
        ptrHistoryIndex++;
    }
    if (0u != (filterCfg & CY_CAPSENSE_POSITION_AVG_MASK))
    {
        temp = xPos;
        /* Perform zero-cross correction */
        if (ptrHistoryIndex->x > (halfResolution + xPos))
        {
            xPos += centroidResolution;
        }
        if (xPos > (halfResolution + ptrHistoryIndex->x))
        {
            ptrHistoryIndex->x += (uint16_t)centroidResolution;
        }
        /* Perform filtering */
        xPos = (xPos + ptrHistoryIndex->x) >> 1u;
        /* Perform zero-cross correction of filtered position */
        if (xPos >= centroidResolution)
        {
            xPos -= centroidResolution;
        }
        ptrHistoryIndex->x = (uint16_t)temp;
        ptrHistoryIndex++;
    }
    if (0u != (filterCfg & CY_CAPSENSE_POSITION_JIT_MASK))
    {
        /* Perform zero-cross correction */
        if (ptrHistoryIndex->x > (halfResolution + xPos))
        {
            xPos += centroidResolution;
        }
        if (xPos > (halfResolution + ptrHistoryIndex->x))
        {
            ptrHistoryIndex->x += (uint16_t)centroidResolution;
        }
        /* Perform filtering */
        xPos = Cy_CapSense_FtJitter(xPos, (uint32_t)ptrHistoryIndex->x);
        /* Perform zero-cross correction of filtered position */
        if (xPos >= centroidResolution)
        {
            xPos -= centroidResolution;
        }
        ptrHistoryIndex->x = (uint16_t)xPos;
    }
    ptrInput->x = (uint16_t)xPos;
}


/*******************************************************************************
* Function Name: Cy_CapSense_ProcessPositionFilters
****************************************************************************//**
*
* Performs filtering of touch positions applying enabled filters.
*
* \param newTouch
* The pointer to the touch structure.
*
* \param ptrHistory
* The pointer to the position structure that holds previous historical 
* position values.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_ProcessPositionFilters(
                cy_stc_capsense_touch_t * newTouch,
                const cy_stc_capsense_widget_config_t * ptrWdConfig,
                cy_stc_capsense_context_t * context)
{
    uint32_t posIndex;
    uint32_t filterCfg;
    uint32_t numPosMin;
    uint32_t filterSize;
    cy_stc_capsense_position_t * ptrHistory;
    cy_stc_capsense_position_t * ptrPos;
    uint32_t numPos = newTouch->numPosition;
    
    /* Position filtering */
    if ((CY_CAPSENSE_POSITION_NONE != numPos) && (CY_CAPSENSE_POSITION_MULTIPLE != numPos))
    {
        filterCfg = ptrWdConfig->posFilterConfig;
        numPosMin = ptrWdConfig->ptrPosFilterHistory->numPosition;
        ptrPos = newTouch->ptrPosition;
        ptrHistory = ptrWdConfig->ptrPosFilterHistory->ptrPosition;
        filterSize = (filterCfg & CY_CAPSENSE_POSITION_FILTERS_SIZE_MASK) >> CY_CAPSENSE_POSITION_FILTERS_SIZE_OFFSET;
        
        /* The same actions should be done for cases with no touches or multiple touches */
        if (CY_CAPSENSE_POSITION_MULTIPLE == numPosMin)
        {
            numPosMin = CY_CAPSENSE_POSITION_NONE;
        }

        /* Find number of position that exists from previous processing */
        if (numPosMin > numPos)
        {
            numPosMin = numPos;
        }
        
        /* Process touches that exists from previous processing */
        for (posIndex = 0u; posIndex < numPosMin; posIndex++)
        {
            Cy_CapSense_RunPositionFilters(ptrWdConfig, ptrPos, ptrHistory);
            ptrPos++;
            ptrHistory += filterSize;
        }
        
        /* Initialize all rest newly detected touches */
        for (; posIndex < numPos; posIndex++)
        {
            Cy_CapSense_InitPositionFilters(filterCfg, ptrPos, ptrHistory);
            ptrPos++;
            ptrHistory += filterSize;
        }
    }
    /* Finally, copy number of positions */
    ptrWdConfig->ptrPosFilterHistory->numPosition = (uint8_t)numPos;
}


/* [] END OF FILE */
